todos/app/controllers/api/todos_controller.rb

INSERT INTO "todos" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "todo 3000"], ["body", "body todo"], ["created_at", "2021-05-03 18:50:43.377079"], ["updated_at", "2021-05-03 18:50:43.377079"]]
---
  def create
    @todo = Todo.new(todo_params)
    if @todo.save